Revit 2027 API
ScheduleSortGroupField(ScheduleFieldId, ScheduleSortOrder) Constructor
 Creates a new ScheduleSortGroupField.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleSortGroupField(
	ScheduleFieldId fieldId,
	ScheduleSortOrder sortOrder
)
Public Sub New (
	fieldId As ScheduleFieldId,
	sortOrder As ScheduleSortOrder
)
public:
ScheduleSortGroupField(
	ScheduleFieldId^ fieldId,
	ScheduleSortOrder sortOrder
)
new :
        fieldId : ScheduleFieldId *
        sortOrder : ScheduleSortOrder -> ScheduleSortGroupField
Parameters
fieldId ScheduleFieldId
 The ID of the field that the schedule will be sorted or grouped by.
sortOrder ScheduleSortOrder
 The sort order, ascending or descending.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ScheduleSortGroupField Class
ScheduleSortGroupField Overload
Autodesk.Revit.DB Namespace